package petto.para.leaguematch.utils

import petto.para.leaguematch.model.TeamData

object Utils {
    val dataListKor = listOf(
        TeamData("Ульсан Хендай", 25, 18, 3, 4, 57),
        TeamData("Пхохан Стилерс", 25, 12, 9, 4, 45),
        TeamData("Чонбук Хендай Моторс", 25, 12, 4, 9, 40),
        TeamData("Сеул", 25, 10, 8, 7, 38),
        TeamData("Кванчжу", 25, 10, 7, 8, 37),
        TeamData("Тэгу", 25, 8, 10, 7, 34),
        TeamData("Тэчжон Ситизен", 25, 8, 9, 8, 33),
        TeamData("Инчхон Юнайтед", 25, 8, 9, 8, 33),
        TeamData("Чеджу Юнайтед", 25, 8, 7, 10, 31),
        TeamData("Сувон Сити", 25, 6, 5, 14, 23),
        TeamData("Сувон Самсунг Блювингс", 25, 4, 6, 15, 18),
        TeamData("Канвон", 25, 2, 11, 12, 17)
    )
    val dataListDen = listOf(
        TeamData("Нордшелланд", 22, 12, 7, 3, 43),
        TeamData("Копенгаген", 22, 13, 3, 6, 42),
        TeamData("Виборг", 22, 10, 7, 5, 37),
        TeamData("Орхус", 22, 10, 5, 7, 35),
        TeamData("Рандерс", 22, 8, 8, 6, 32),
        TeamData("Брондбю", 22, 8, 6, 8, 30),
        TeamData("Силькеборг", 22, 8, 5, 9, 29),
        TeamData("Мидтьюлланд", 22, 6, 10, 6, 28),
        TeamData("Оденсе", 22, 7, 7, 8, 28),
        TeamData("Хорсенс", 22, 6, 5, 11, 23),
        TeamData("Люнгбю", 22, 3, 7, 12, 16),
        TeamData("Ольборг", 22, 3, 6, 13, 15)
    )

    val dataListArg = listOf(
        TeamData("Ривер Плейт", 28, 20, 4, 4, 64),
        TeamData("Тальерес", 27, 14, 8, 5, 50),
        TeamData("Сан-Лоренсо", 27, 12, 10, 5, 46),
        TeamData("Ланус", 27, 12, 9, 6, 45),
        TeamData("Эстудиантес", 27, 12, 9, 6, 45),
        TeamData("Дефенса и Хустисия", 28, 12, 8, 8, 44),
        TeamData("Бока Хуниорс", 27, 13, 5, 9, 44),
        TeamData("Росарио Сентраль", 27, 10, 12, 5, 42),
        TeamData("Годой-Крус", 27, 11, 8, 8, 41),
        TeamData("Аргентинос Хуниорс", 27, 11, 7, 9, 40),
        TeamData("Атлетико Тукуман", 27, 9, 10, 8, 37),
        TeamData("Расинг А", 27, 9, 9, 9, 36),
        TeamData("Бельграно", 27, 10, 6, 11, 36),
        TeamData("Ньюэллс Олд Бойз", 27, 8, 11, 8, 35),
        TeamData("Барракас Сентраль", 27, 8, 11, 8, 35),
        TeamData("Тигре", 27, 9, 7, 11, 34),
        TeamData("Платенсе", 27, 9, 7, 11, 34),
        TeamData("Институто", 27, 8, 8, 11, 32),
        TeamData("Атлетико Сармьенто", 27, 7, 9, 11, 30),
        TeamData("Унион", 27, 6, 12, 9, 30),
        TeamData("Банфилд", 27, 7, 9, 11, 30),
        TeamData("Химнасия и Эсгрима", 27, 7, 9, 11, 30),
        TeamData("Сентраль Кордова", 27, 7, 8, 12, 29),
        TeamData("Индепендьенте", 27, 6, 10, 11, 28),
        TeamData("Велес Сарсфилд", 27, 5, 12, 10, 27),
        TeamData("Уракан", 27, 6, 7, 14, 25),
        TeamData("Колон", 27, 4, 13, 10, 25),
        TeamData("Арсенал Саранди", 27, 6, 4, 17, 22)
    )
    val dataListEcu = listOf(
        TeamData("Аукас", 15, 9, 6, 0, 33),
        TeamData("Индепендьенте дель Валье", 15, 9, 2, 4, 29),
        TeamData("Универсидад Католика Кито", 15, 8, 3, 4, 27),
        TeamData("ЛДУ Кито", 15, 7, 5, 3, 26),
        TeamData("Эмелек", 15, 7, 4, 4, 25),
        TeamData("Депортиво Куэнка", 15, 6, 4, 5, 22),
        TeamData("Текнико Университарио", 15, 6, 4, 5, 22),
        TeamData("Барселона Гуаякиль", 15, 5, 6, 4, 21),
        TeamData("Дельфин", 15, 5, 4, 6, 19),
        TeamData("Оренсе", 15, 4, 6, 5, 18),
        TeamData("Кумбайя", 15, 4, 6, 5, 18),
        TeamData("Гуаякиль Сити", 15, 4, 5, 6, 17),
        TeamData("Гуаласео", 15, 4, 2, 9, 14),
        TeamData("Мушук Руна", 15, 2, 6, 7, 12),
        TeamData("Макара", 15, 2, 5, 8, 11),
        TeamData("9 октября", 15, 2, 4, 9, 10)
    )
}